In [1]:
# Import numpy and pandas modules
import numpy as np
import pandas as pd

**Create a Pandas DataFrame**

In [3]:
# We will use a small dataset for our simple example
# Data Stored in a python dictionary

data = {
    'dogs': [23, 17, 5, 12, 1, 5],
    'birds': [10, 7, 13, 2, 8, 19],
    'cats': [4, 14, 8, 15, 11, 3]}
data

{'birds': [10, 7, 13, 2, 8, 19],
 'cats': [4, 14, 8, 15, 11, 3],
 'dogs': [23, 17, 5, 12, 1, 5]}

In [4]:
# Convert dictionary to a pandas dataframe
# Notice that index numbers are serially generated

shelter = pd.DataFrame(data)
shelter

   dogs  birds  cats
0    23     10     4
1    17      7    14
2     5     13     8
3    12      2    15
4     1      8    11
5     5     19     3

In [5]:
# Finding information about the dataframe
shelter.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   dogs    6 non-null      int64
 1   birds   6 non-null      int64
 2   cats    6 non-null      int64
dtypes: int64(3)
memory usage: 272.0 bytes

In [6]:
# Take a look at the head of the dataframe
shelter.head(n=3)

   dogs  birds  cats
0    23     10     4
1    17      7    14
2     5     13     8

In [7]:
# Let's take a look at the last 5 values (tail of the dataframe)
shelter.tail()

   dogs  birds  cats
1    17      7    14
2     5     13     8
3    12      2    15
4     1      8    11
5     5     19     3

In [8]:
# Create a dataframe with index names specified
# data is the dataset in dictionary format
# Index names are in a list format

idx_names = ['shelter0', 'shelter1', 'shelter2', 'shelter3', 'shelter4', 'shelter5']
shelter_indexname = pd.DataFrame(data, index=idx_names)
shelter_indexname

          dogs  birds  cats
shelter0    23     10     4
shelter1    17      7    14
shelter2     5     13     8
shelter3    12      2    15
shelter4     1      8    11
shelter5     5     19     3

**Wokring with Rows and Columns**

In [9]:
# Select row only by label using loc[]
# .loc refers to label
shelter_indexname.loc['shelter3']

dogs     12
birds     2
cats     15
Name: shelter3, dtype: int64

In [10]:
# Select row and column using loc[]
# .loc refers to label
shelter_indexname.loc['shelter3','birds']

2

In [11]:
# Slice by row using index positions 
shelter_indexname[2:5]

          dogs  birds  cats
shelter2     5     13     8
shelter3    12      2    15
shelter4     1      8    11

In [12]:
# Slice by row using label names (values and not index position)
shelter_indexname['shelter2':'shelter5']

          dogs  birds  cats
shelter2     5     13     8
shelter3    12      2    15
shelter4     1      8    11
shelter5     5     19     3

In [13]:
# Select column with slice method (all rows and column at index position 1)
# You will get back the birds column which is index position 1 column-wise
# i refers to index
shelter_indexname.iloc[:, 1]

shelter0    10
shelter1     7
shelter2    13
shelter3     2
shelter4     8
shelter5    19
Name: birds, dtype: int64

In [14]:
# Select multiple rows and columns with slice method
# Similar to pythonic way of indexing
shelter_indexname.iloc[2:5, 0:2]

          dogs  birds
shelter2     5     13
shelter3    12      2
shelter4     1      8

In [15]:
# Select column using dot notation or bracket
# shelter_indexname.dogs
shelter_indexname['dogs']

shelter0    23
shelter1    17
shelter2     5
shelter3    12
shelter4     1
shelter5     5
Name: dogs, dtype: int64

In [16]:
# Select multiple columns with brackets
shelter_indexname[['dogs','cats']]

          dogs  cats
shelter0    23     4
shelter1    17    14
shelter2     5     8
shelter3    12    15
shelter4     1    11
shelter5     5     3

In [17]:
# Select column names with no parentheses
shelter_indexname.columns

Index(['dogs', 'birds', 'cats'], dtype='object')

In [18]:
# Sorting by vaues
shelter_indexname.sort_values(by='cats')

          dogs  birds  cats
shelter5     5     19     3
shelter0    23     10     4
shelter2     5     13     8
shelter4     1      8    11
shelter1    17      7    14
shelter3    12      2    15

In [19]:
# Summary statistics
shelter_indexname.describe()

           dogs      birds       cats
count   6.00000   6.000000   6.000000
mean   10.50000   9.833333   9.166667
std     8.38451   5.776389   5.036533
min     1.00000   2.000000   3.000000
25%     5.00000   7.250000   5.000000
50%     8.50000   9.000000   9.500000
75%    15.75000  12.250000  13.250000
max    23.00000  19.000000  15.000000

In [20]:
# transpose data (rows become columns and columns will become rows)
shelter_indexname.T

       shelter0  shelter1  shelter2  shelter3  shelter4  shelter5
dogs         23        17         5        12         1         5
birds        10         7        13         2         8        19
cats          4        14         8        15        11         3